qa = new Array();
//
// qa[110] = ["",  "",""];

// qa[110] = ["",  "", ""];
// qa[110] = ["",  "", ""];
// qa[110] = ["",  "",""];
// qa[110] = ["",  "", ""];
// qa[110] = ["", "", ""];



qa[76] = ["HTMLのﾘﾝｸﾀｸﾞは",
          "aﾀｸﾞ=anchor(ｱﾝｶｰ=船のいかり)",
          "76_04/94.01-04.さまざまなHTMLﾀｸﾞ_&lt;a href=&quot;https:～～&quot; &gt; &lt;/a&gt; 参考_href(ｴｲﾁﾚﾌ)=hypertext reference(ﾊｲﾊﾟｰﾃｷｽﾄﾘﾌｧﾚﾝｽ=ﾊｲﾊﾟｰﾃｷｽﾄの参照)"];

qa[4] = ["HTMLの段落ﾀｸﾞは",
          "pﾀｸﾞ=paragraph(ﾊﾟﾗｸﾞﾗﾌ=段落)",
          "4_04/94.01-04.さまざまなHTMLﾀｸﾞ_&lt;p&gt;&nbsp;&lt;/p&gt; 参考_&lt;br&gt;ﾀｸﾞを文面に入れることで改行できます。br=break(ﾌﾞﾚｰｸ=改行)"];

qa[3] = ["HTMLの見出しﾀｸﾞは",
          "hﾀｸﾞ=header(ﾍｯﾀﾞｰ=見出し)",
          "3_04/94.01-04.さまざまなHTMLﾀｸﾞ_&lt;h1&gt; &lt;/h1&gt;&nbsp;参考_&lt;body&gt; &lt;/body&gt;ﾀｸﾞ内に入力します。なお、h1～h6まであります"];
